In [4]:
pip install jupysql

Requirement already satisfied: jupysql in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (0.11.1)
Requirement already satisfied: prettytable>=3.12.0 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from jupysql) (3.16.0)
Requirement already satisfied: sqlalchemy in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from jupysql) (2.0.43)
Requirement already satisfied: sqlparse in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from jupysql) (0.5.3)
Requirement already satisfied: ipython-genutils>=0.1.0 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from jupysql) (0.2.0)
Requirement already satisfied: jinja2 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from jupysql) (3.1.6)
Requirement already satisfied: sqlglot>=11.3.7 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from jupysql) (27.14.0)
Requirement already satisfied: jupysql-plugin>=0.4.2 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from jupysql) (0.4.5)
Requirement already satisfied: ploomber-core>=0.2.7 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from jupysql) (0.2.27)
Requirement already satisfied: pyyaml in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from ploomber-core>=0.2.7->jupysql) (6.0.2)
Requirement already satisfied: posthog>=3.0 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from ploomber-core>=0.2.7->jupysql) (6.7.4)
Requirement already satisfied: requests<3.0,>=2.7 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from posthog>=3.0->ploomber-core>=0.2.7->jupysql) (2.32.4)
Requirement already satisfied: six>=1.5 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from posthog>=3.0->ploomber-core>=0.2.7->jupysql) (1.17.0)
Requirement already satisfied: python-dateutil>=2.2 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from posthog>=3.0->ploomber-core>=0.2.7->jupysql) (2.9.0.post0)
Requirement already satisfied: backoff>=1.10.0 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from posthog>=3.0->ploomber-core>=0.2.7->jupysql) (2.2.1)
Requirement already satisfied: distro>=1.5.0 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from posthog>=3.0->ploomber-core>=0.2.7->jupysql) (1.9.0)
Requirement already satisfied: typing-extensions>=4.2.0 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from posthog>=3.0->ploomber-core>=0.2.7->jupysql) (4.14.1)
Requirement already satisfied: charset_normalizer<4,>=2 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from requests<3.0,>=2.7->posthog>=3.0->ploomber-core>=0.2.7->jupysql) (3.4.2)
Requirement already satisfied: idna<4,>=2.5 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from requests<3.0,>=2.7->posthog>=3.0->ploomber-core>=0.2.7->jupysql) (3.10)
Requirement already satisfied: urllib3<3,>=1.21.1 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from requests<3.0,>=2.7->posthog>=3.0->ploomber-core>=0.2.7->jupysql) (2.5.0)
Requirement already satisfied: certifi>=2017.4.17 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from requests<3.0,>=2.7->posthog>=3.0->ploomber-core>=0.2.7->jupysql) (2025.8.3)
Requirement already satisfied: wcwidth in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from prettytable>=3.12.0->jupysql) (0.2.13)
Requirement already satisfied: MarkupSafe>=2.0 in /Library/Frameworks/Python.framework/Versions/3.13/lib/python3.13/site-packages (from jinja2->jupysql) (3.0.2)
Note: you may need to restart the kernel to use updated packages.

In [20]:
%load_ext sql
%sql sqlite:///practice.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [16]:
%%sql
CREATE TABLE IF NOT EXISTS Manufacturers (
  Code INTEGER,
  Name VARCHAR(255) NOT NULL,
  PRIMARY KEY (Code)
);
CREATE TABLE IF NOT EXISTS Products (
  Code INTEGER,
  Name VARCHAR(255) NOT NULL,
  Price DECIMAL NOT NULL,
  Manufacturer INTEGER NOT NULL,
  PRIMARY KEY (Code),
  FOREIGN KEY (Manufacturer) REFERENCES Manufacturers(Code)
);
INSERT OR IGNORE INTO Manufacturers (Code, Name) VALUES (1, 'Sony');
INSERT OR IGNORE INTO Manufacturers (Code, Name) VALUES (2, 'Creative Labs');
INSERT OR IGNORE INTO Manufacturers (Code, Name) VALUES (3, 'Hewlett-Packard');
INSERT OR IGNORE INTO Manufacturers (Code, Name) VALUES (4, 'Iomega');
INSERT OR IGNORE INTO Manufacturers (Code, Name) VALUES (5, 'Fujitsu');
INSERT OR IGNORE INTO Manufacturers (Code, Name) VALUES (6, 'Winchester');
INSERT OR IGNORE INTO Products (Code, Name, Price, Manufacturer) VALUES (1, 'Hard drive', 240, 5);
INSERT OR IGNORE INTO Products (Code, Name, Price, Manufacturer) VALUES (2, 'Memory', 120, 6);
INSERT OR IGNORE INTO Products (Code, Name, Price, Manufacturer) VALUES (3, 'ZIP drive', 150, 4);
INSERT OR IGNORE INTO Products (Code, Name, Price, Manufacturer) VALUES (4, 'Floppy disk', 5, 6);
INSERT OR IGNORE INTO Products (Code, Name, Price, Manufacturer) VALUES (5, 'Monitor', 240, 1);
INSERT OR IGNORE INTO Products (Code, Name, Price, Manufacturer) VALUES (6, 'DVD drive', 180, 2);
INSERT OR IGNORE INTO Products (Code, Name, Price, Manufacturer) VALUES (7, 'CD drive', 90, 2);
INSERT OR IGNORE INTO Products (Code, Name, Price, Manufacturer) VALUES (8, 'Printer', 270, 3);
INSERT OR IGNORE INTO Products (Code, Name, Price, Manufacturer) VALUES (9, 'Toner cartridge', 66, 3);
INSERT OR IGNORE INTO Products (Code, Name, Price, Manufacturer) VALUES (10, 'DVD burner', 180, 2);

Running query in 'sqlite:///practice.db'

++
||
++
++

In [34]:
%%sql
-- name and price
SELECT Name, Price
FROM Products;

Running query in 'sqlite:///practice.db'

+-----------------+-------+
|       Name      | Price |
+-----------------+-------+
|    Hard drive   |  240  |
|      Memory     |  120  |
|    ZIP drive    |  150  |
|   Floppy disk   |   5   |
|     Monitor     |  240  |
|    DVD drive    |  180  |
|     CD drive    |   90  |
|     Printer     |  270  |
| Toner cartridge |   66  |
|    DVD burner   |  180  |
+-----------------+-------+
Truncated to displaylimit of 10.

In [37]:
%%sql
-- all the products with a price between $60 and $120
Select Name
From Products
Where price between 60 and 120;

Running query in 'sqlite:///practice.db'

+-----------------+
|       Name      |
+-----------------+
|      Memory     |
|     CD drive    |
| Toner cartridge |
+-----------------+

In [42]:
%%sql
-- Compute the average price of all the products
Select Avg(price) as Average_Price
from Products;

Running query in 'sqlite:///practice.db'

+---------------+
| Average_Price |
+---------------+
|     154.1     |
+---------------+

In [43]:
%%sql
-- Compute the average price of all products with manufacturer code equal to 2
select avg(price)
From Products
where Manufacturer = 2

Running query in 'sqlite:///practice.db'

+------------+
| avg(price) |
+------------+
|   150.0    |
+------------+

In [44]:
%%sql
-- Compute the number of products with a price larger than or equal to $180
select count(*)
from Products
where price >= 180

Running query in 'sqlite:///practice.db'

+----------+
| count(*) |
+----------+
|    5     |
+----------+

In [48]:
%%sql
-- Select the name and price with a price larger or equal to $180, and sort first by price (in descending order), and then by name (in ascending order)
select name, price
from Products
where price >= 180
order by price desc, name asc;

Running query in 'sqlite:///practice.db'

+------------+-------+
|    Name    | Price |
+------------+-------+
|  Printer   |  270  |
| Hard drive |  240  |
|  Monitor   |  240  |
| DVD burner |  180  |
| DVD drive  |  180  |
+------------+-------+

In [49]:
%%sql
-- Select all the data from the products, including all the data for each product's manufacturer
Select p.*,m.Name
from Products p
join Manufacturers m
on p.Manufacturer = m.Code

Running query in 'sqlite:///practice.db'

+------+-----------------+-------+--------------+-----------------+
| Code |       Name      | Price | Manufacturer |      Name_1     |
+------+-----------------+-------+--------------+-----------------+
|  1   |    Hard drive   |  240  |      5       |     Fujitsu     |
|  2   |      Memory     |  120  |      6       |    Winchester   |
|  3   |    ZIP drive    |  150  |      4       |      Iomega     |
|  4   |   Floppy disk   |   5   |      6       |    Winchester   |
|  5   |     Monitor     |  240  |      1       |       Sony      |
|  6   |    DVD drive    |  180  |      2       |  Creative Labs  |
|  7   |     CD drive    |   90  |      2       |  Creative Labs  |
|  8   |     Printer     |  270  |      3       | Hewlett-Packard |
|  9   | Toner cartridge |   66  |      3       | Hewlett-Packard |
|  10  |    DVD burner   |  180  |      2       |  Creative Labs  |
+------+-----------------+-------+--------------+-----------------+
Truncated to displaylimit of 10.

In [50]:
%%sql
-- Select the product name, price, and manufacturer name of all the products
Select p.Name, p.price,m.Name
from Products p
join Manufacturers m
on p.Manufacturer = m.Code

Running query in 'sqlite:///practice.db'

+-----------------+-------+-----------------+
|       Name      | Price |      Name_1     |
+-----------------+-------+-----------------+
|    Hard drive   |  240  |     Fujitsu     |
|      Memory     |  120  |    Winchester   |
|    ZIP drive    |  150  |      Iomega     |
|   Floppy disk   |   5   |    Winchester   |
|     Monitor     |  240  |       Sony      |
|    DVD drive    |  180  |  Creative Labs  |
|     CD drive    |   90  |  Creative Labs  |
|     Printer     |  270  | Hewlett-Packard |
| Toner cartridge |   66  | Hewlett-Packard |
|    DVD burner   |  180  |  Creative Labs  |
+-----------------+-------+-----------------+
Truncated to displaylimit of 10.

In [55]:
%%sql
-- Select the average price of each manufacturer's products, showing the manufacturer's name
Select avg(p.price),m.Name
from Products p
join Manufacturers m
on p.Manufacturer = m.Code
group by m.Name

Running query in 'sqlite:///practice.db'

+--------------+-----------------+
| avg(p.price) |       Name      |
+--------------+-----------------+
|    150.0     |  Creative Labs  |
|    240.0     |     Fujitsu     |
|    168.0     | Hewlett-Packard |
|    150.0     |      Iomega     |
|    240.0     |       Sony      |
|     62.5     |    Winchester   |
+--------------+-----------------+

In [56]:
%%sql
-- Select the name and price of the cheapest product.
select name, price
from Products
where price =(select min(price) from Products)

Running query in 'sqlite:///practice.db'

+-------------+-------+
|     Name    | Price |
+-------------+-------+
| Floppy disk |   5   |
+-------------+-------+

In [59]:
%%sql
-- Select the name of each manufacturer along with the name and price of its most expensive product
select m.name as Manufacturer, p.name as Product,p.price
from Manufacturers m
join Products p
on m.Code = p.Manufacturer
group by m.Name
having price = (select max(p2.price) from Products p2 where p2.Manufacturer = p.Manufacturer);

Running query in 'sqlite:///practice.db'

+-----------------+------------+-------+
|   Manufacturer  |  Product   | Price |
+-----------------+------------+-------+
|  Creative Labs  | DVD drive  |  180  |
|     Fujitsu     | Hard drive |  240  |
| Hewlett-Packard |  Printer   |  270  |
|      Iomega     | ZIP drive  |  150  |
|       Sony      |  Monitor   |  240  |
|    Winchester   |   Memory   |  120  |
+-----------------+------------+-------+

In [61]:
%%sql
-- Apply a 10% discount to all products
update Products
set price = price*0.9

Running query in 'sqlite:///practice.db'

10 rows affected.

++
||
++
++